slides/slides.org
#+OPTIONS: toc:nil date:nil author:nil reveal_mathjax:t
#+OPTIONS: timestamp:nil
#+REVEAL_TRANS: linear
#+Title: A simple racket Interpreter: IMP

* Objectives

** Objectives

- Present the syntax of IMP language.

- Defining the IMP lexer and parser using Lex and yacc for racket

** Objectives

- Implementing the interpreter for IMP

- Using the racket features for creating the IMP language within the
  racket interpreter.

* IMP language

** Syntax

\begin{array}{lcl}
   stmts & \to  & stmt\:\mathrm{;}\:stmts\,|\,\lambda\\
   stmt  & \to  & \mathrm{input}\:id\,|\,\mathrm{print}\:expr\\
         & \mid & id\,\mathrm{:=}\,expr\,|\,\mathrm{while}\:expr\:\mathrm{do}\,block\\
         & \mid & \mathrm{if}\,expr\,\mathrm{then}\,block\,\mathrm{else}\,block\\
   block & \to  & \mathrm{\{}\,stmts\,\mathrm{\}}\\
\end{array}

** Syntax

\begin{array}{lcl}
   expr  & \to  & n\\
         & \mid & expr\,\mathrm{+}\,expr\\
         & \mid & expr\,\mathrm{-}\,expr\\
         & \mid & expr\,\mathrm{*}\,expr\\
         & \mid & expr\,\mathrm{/}\,expr\\
\end{array}

** Syntax

\begin{array}{lcl}
   expr  & \to  & expr\,\mathrm{<}\,expr\\
         & \mid & expr\,\mathrm{==}\,expr\\
         & \mid & expr\,\mathrm{\&\&}\,expr\\
         & \mid & \mathrm{!}\,expr\\
\end{array}

* Implementation

** Defining the lexer

#+begin_src racket
(define-tokens var-tokens (IDENTIFIER))
(define-empty-tokens syntax-tokens
  (EOF
   ADD
   SUBTRACT
   PRODUCT
   DIVISION
   ... ))
#+end_src


** Defining the lexer

#+begin_src racket
(define next-token
  (lexer-src-pos
     [(eof) (token-EOF)]
     [(:+ #\newline whitespace)
      (return-without-pos (next-token input-port))]
     [#\+ (token-ADD)]
     [#\- (token-SUBTRACT)]
     ...
     ["if" (token-IF)]
     [(:: alphabetic (:* (:+ alphabetic numeric)))
      (token-IDENTIFIER lexeme)]))
#+end_src

** Syntax tree

#+begin_src racket
(struct value
  (value)
  #:transparent)

(struct var
  (id)
  #:transparent)

(struct add
  (left right)
  #:transparent)  
#+end_src

** Defining the parser

#+begin_src racket
(define imp-parser
  (parser
   (start statements)
   (end EOF)
   (tokens value-tokens var-tokens syntax-tokens)
   (src-pos)
#+end_src

** Defining the parser

#+begin_src racket
   (precs
    (nonassoc NOT EQ LT)
    (left ADD SUBTRACT)
    (left PRODUCT DIVISION AND))  
#+end_src

** Defining the parser

#+begin_src racket
   (grammar
    (statements [() '()]
                [(statement statements) (cons $1 $2)])
    (statement [(IDENTIFIER ASSIGN expr SEMI) (assign (var $1) $3)]
               [(PRINT expr SEMI) (sprint $2)]
               [(IF expr THEN block ELSE block) (eif $2 $4 $6)]
               [(WHILE expr DO block) (ewhile $2 $4)]
               [(INPUT IDENTIFIER SEMI) (input (var $2))])
    (block [(BEGIN statements END) $2])
#+end_src

