slides/slides.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>A simple racket Interpreter: IMP</title>
<meta name="author" content="Rodrigo Ribeiro"/>
<link rel="stylesheet" href="file:///Users/rodrigo/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="file:///Users/rodrigo/reveal.js/dist/theme/black.css" id="theme"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide">
<h1 class="title">A simple racket Interpreter: IMP</h1>
</section>

<section>
<section id="slide-1">
<h2 id="1"><span class="section-number-2">1.</span> Objectives</h2>
<div class="outline-text-2" id="text-1">
</div>
</section>
<section id="slide-1-1">
<h3 id="1-1"><span class="section-number-3">1.1.</span> Objectives</h3>
<ul>
<li>Present the syntax of IMP language.</li>

<li>Defining the IMP lexer and parser using Lex and yacc for racket</li>

</ul>

</section>
<section id="slide-1-2">
<h3 id="1-2"><span class="section-number-3">1.2.</span> Objectives</h3>
<ul>
<li>Implementing the interpreter for IMP</li>

<li>Using the racket features for creating the IMP language within the
racket interpreter.</li>

</ul>

</section>
</section>
<section>
<section id="slide-2">
<h2 id="2"><span class="section-number-2">2.</span> IMP language</h2>
<div class="outline-text-2" id="text-2">
</div>
</section>
<section id="slide-2-1">
<h3 id="2-1"><span class="section-number-3">2.1.</span> Syntax</h3>
<div>
\begin{array}{lcl}
   stmts & \to  & stmt\:\mathrm{;}\:stmts\,|\,\lambda\\
   stmt  & \to  & \mathrm{input}\:id\,|\,\mathrm{print}\:expr\\
         & \mid & id\,\mathrm{:=}\,expr\,|\,\mathrm{while}\:expr\:\mathrm{do}\,block\\
         & \mid & \mathrm{if}\,expr\,\mathrm{then}\,block\,\mathrm{else}\,block\\
   block & \to  & \mathrm{\{}\,stmts\,\mathrm{\}}\\
\end{array}

</div>

</section>
<section id="slide-2-2">
<h3 id="2-2"><span class="section-number-3">2.2.</span> Syntax</h3>
<div>
\begin{array}{lcl}
   expr  & \to  & n\\
         & \mid & expr\,\mathrm{+}\,expr\\
         & \mid & expr\,\mathrm{-}\,expr\\
         & \mid & expr\,\mathrm{*}\,expr\\
         & \mid & expr\,\mathrm{/}\,expr\\
\end{array}

</div>

</section>
<section id="slide-2-3">
<h3 id="2-3"><span class="section-number-3">2.3.</span> Syntax</h3>
<div>
\begin{array}{lcl}
   expr  & \to  & expr\,\mathrm{<}\,expr\\
         & \mid & expr\,\mathrm{==}\,expr\\
         & \mid & expr\,\mathrm{\&\&}\,expr\\
         & \mid & \mathrm{!}\,expr\\
\end{array}

</div>

</section>
</section>
<section>
<section id="slide-3">
<h2 id="3"><span class="section-number-2">3.</span> Implementation</h2>
<div class="outline-text-2" id="text-3">
</div>
</section>
<section id="slide-3-1">
<h3 id="3-1"><span class="section-number-3">3.1.</span> Defining the lexer</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span>define-tokens <span style="color: #7590db;">var-tokens</span> <span style="color: #bc6ec5;">(</span>IDENTIFIER<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
<span style="color: #4f97d7;">(</span>define-empty-tokens <span style="color: #7590db;">syntax-tokens</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #ce537a; font-weight: bold;">EOF</span>
   ADD
   SUBTRACT
   PRODUCT
   DIVISION
   <span style="color: #4f97d7; font-weight: bold;">...</span> <span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>


</section>
<section id="slide-3-2">
<h3 id="3-2"><span class="section-number-3">3.2.</span> Defining the lexer</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #7590db;">next-token</span>
  <span style="color: #bc6ec5;">(</span>lexer-src-pos
     <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span><span style="color: #4f97d7;">eof</span><span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>token-EOF<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
     <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>:+ <span style="color: #a45bad;">#\newline</span> whitespace<span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>return-without-pos <span style="color: #b1951d;">(</span>next-token input-port<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
     <span style="color: #2d9574;">[</span><span style="color: #a45bad;">#\+</span> <span style="color: #67b11d;">(</span>token-ADD<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
     <span style="color: #2d9574;">[</span><span style="color: #a45bad;">#\-</span> <span style="color: #67b11d;">(</span>token-SUBTRACT<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
     <span style="color: #4f97d7; font-weight: bold;">...</span>
     <span style="color: #2d9574;">[</span><span style="color: #2d9574;">"if"</span> <span style="color: #67b11d;">(</span>token-IF<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
     <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>:: alphabetic <span style="color: #b1951d;">(</span>:* <span style="color: #4f97d7;">(</span>:+ alphabetic numeric<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
      <span style="color: #67b11d;">(</span>token-IDENTIFIER lexeme<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
<section id="slide-3-3">
<h3 id="3-3"><span class="section-number-3">3.3.</span> Syntax tree</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">struct</span> value
  <span style="color: #bc6ec5;">(</span>value<span style="color: #bc6ec5;">)</span>
  <span style="color: #cd5c5c;">#:transparent</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">struct</span> var
  <span style="color: #bc6ec5;">(</span>id<span style="color: #bc6ec5;">)</span>
  <span style="color: #cd5c5c;">#:transparent</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">struct</span> add
  <span style="color: #bc6ec5;">(</span>left right<span style="color: #bc6ec5;">)</span>
  <span style="color: #cd5c5c;">#:transparent</span><span style="color: #4f97d7;">)</span>  
</pre>
</div>

</section>
<section id="slide-3-4">
<h3 id="3-4"><span class="section-number-3">3.4.</span> Defining the parser</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #7590db;">imp-parser</span>
  <span style="color: #bc6ec5;">(</span>parser
   <span style="color: #2d9574;">(</span>start statements<span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>end <span style="color: #ce537a; font-weight: bold;">EOF</span><span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>tokens value-tokens var-tokens syntax-tokens<span style="color: #2d9574;">)</span>
   <span style="color: #2d9574;">(</span>src-pos<span style="color: #2d9574;">)</span>
</pre>
</div>

</section>
<section id="slide-3-5">
<h3 id="3-5"><span class="section-number-3">3.5.</span> Defining the parser</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span>precs
 <span style="color: #bc6ec5;">(</span>nonassoc NOT EQ LT<span style="color: #bc6ec5;">)</span>
 <span style="color: #bc6ec5;">(</span>left ADD SUBTRACT<span style="color: #bc6ec5;">)</span>
 <span style="color: #bc6ec5;">(</span>left PRODUCT DIVISION AND<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>  
</pre>
</div>

</section>
<section id="slide-3-6">
<h3 id="3-6"><span class="section-number-3">3.6.</span> Defining the parser</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span>grammar
 <span style="color: #bc6ec5;">(</span>statements <span style="color: #2d9574;">[</span><span style="color: #67b11d;">()</span> '<span style="color: #67b11d;">()</span><span style="color: #2d9574;">]</span>
             <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>statement statements<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">cons</span> $1 $2<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>
 <span style="color: #bc6ec5;">(</span>statement <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>IDENTIFIER ASSIGN expr SEMI<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>assign <span style="color: #b1951d;">(</span>var $1<span style="color: #b1951d;">)</span> $3<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
            <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>PRINT expr SEMI<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>sprint $2<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
            <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>IF expr THEN block ELSE block<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>eif $2 $4 $6<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
            <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>WHILE expr DO block<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>ewhile $2 $4<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
            <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>INPUT IDENTIFIER SEMI<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>input <span style="color: #b1951d;">(</span>var $2<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>
 <span style="color: #bc6ec5;">(</span>block <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>BEGIN statements END<span style="color: #67b11d;">)</span> $2<span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span>
</pre>
</div>

</section>
