slides/slides.org
** Defining the parser

#+begin_src racket
    (expr  [(NUMBER) (value $1)]
           [(IDENTIFIER) (var $1)]
           [(expr ADD expr) (add $1 $3)]
           [(expr SUBTRACT expr) (minus $1 $3)]
           [(expr PRODUCT expr) (mult $1 $3)]
           [(expr DIVISION expr) (divv $1 $3)]
           [(expr LT expr) (lt $1 $3)]
           [(expr EQ expr) (eeq $1 $3)]
           [(expr AND expr) (eand $1 $3)]
           [(NOT expr) (enot $2)]
           [(LPAREN expr RPAREN) $2]))
#+end_src

** The interpreter

#+begin_src racket
  (define (eval-stmt env s)
    (match s
      [(input (var v))
       (begin
          (display "Enter a value:")
          (read-value env v))]
      [(assign v e) (eval-assign env (var-id v) e)]
      ...
      [(ewhile e1 blk1)
       (let ([c (eval-expr env e1)])
         (if (true-value? (cdr c))
             (eval-stmt (eval-stmts env blk1)
                        (ewhile e1 blk1))
             env))]))
#+end_src

** Writing the interpreter

#+begin_src racket
  (define (eval-expr env e)
    (match e
      [(value val) (cons env (value val))]
      [(add e1 e2) (eval-op + env e1 e2)]
      [(minus e1 e2) (eval-op - env e1 e2)]
      ...
      [(var v) (lookup-env env (var-id v))]))
#+end_src

** Writing the interpreter

#+begin_src racket
(define (op-value f env v1 v2)
  (cons env (value (f (value-value v1)
                      (value-value v2)))))

(define (eval-op f env e1 e2)
  (let* ([r1 (eval-expr env e1)]
         [r2 (eval-expr (car r1) e2)])
    (op-value f (car r2) (cdr r1) (cdr r2))))
#+end_src

* Making IMP language

** Creating languages in Racket

- To create a new language using a _raco_ project, you
  need to define a reader.
- A reader is a module that implements a function named
  _read-syntax_

** Creating languages in Racket

- The function read-syntax receives two parameters:
  1) the path of the input file and 2) the port to read data from the file.

- It should return a _syntax object_ of the code parsed
  from the input file.

** The IMP reader

#+begin_src racket
(provide (rename-out [imp-read-syntax read-syntax]))

(define (imp-read-syntax path port)
  (datum->syntax
   #f
   `(module imp-mod racket
      ,(finish (imp-interp (parse port))))))

(define (finish env)
  (displayln "Finished!"))  
#+end_src

