slides/slides.html
<section id="slide-3-7">
<h3 id="3-7"><span class="section-number-3">3.7.</span> Defining the parser</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span>expr  <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>NUMBER<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>value $1<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>IDENTIFIER<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>var $1<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>expr ADD expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>add $1 $3<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>expr SUBTRACT expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>minus $1 $3<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>expr PRODUCT expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>mult $1 $3<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>expr DIVISION expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>divv $1 $3<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>expr LT expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>lt $1 $3<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>expr EQ expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>eeq $1 $3<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>expr AND expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>eand $1 $3<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>NOT expr<span style="color: #2d9574;">)</span> <span style="color: #2d9574;">(</span>enot $2<span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">]</span>
       <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">(</span>LPAREN expr RPAREN<span style="color: #2d9574;">)</span> $2<span style="color: #bc6ec5;">]</span><span style="color: #4f97d7;">)</span><span style="color: #e0211d; text-decoration: overline;">)</span>
</pre>
</div>

</section>
<section id="slide-3-8">
<h3 id="3-8"><span class="section-number-3">3.8.</span> The interpreter</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">eval-stmt</span> env s<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">match</span> s
    <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>input <span style="color: #b1951d;">(</span>var v<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">begin</span>
        <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">display</span> <span style="color: #2d9574;">"Enter a value:"</span><span style="color: #b1951d;">)</span>
        <span style="color: #b1951d;">(</span>read-value env v<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>assign v e<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>eval-assign env <span style="color: #b1951d;">(</span>var-id v<span style="color: #b1951d;">)</span> e<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">...</span>
    <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>ewhile e1 blk1<span style="color: #67b11d;">)</span>
     <span style="color: #67b11d;">(</span><span style="color: #4f97d7; font-weight: bold;">let</span> <span style="color: #b1951d;">(</span><span style="color: #4f97d7;">[</span><span style="color: #7590db;">c</span> <span style="color: #bc6ec5;">(</span>eval-expr env e1<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">]</span><span style="color: #b1951d;">)</span>
       <span style="color: #b1951d;">(</span><span style="color: #4f97d7; font-weight: bold;">if</span> <span style="color: #4f97d7;">(</span>true-value? <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">cdr</span> c<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
           <span style="color: #4f97d7;">(</span>eval-stmt <span style="color: #bc6ec5;">(</span>eval-stmts env blk1<span style="color: #bc6ec5;">)</span>
                      <span style="color: #bc6ec5;">(</span>ewhile e1 blk1<span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
           env<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
<section id="slide-3-9">
<h3 id="3-9"><span class="section-number-3">3.9.</span> Writing the interpreter</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">eval-expr</span> env e<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">match</span> e
    <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>value val<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">cons</span> env <span style="color: #b1951d;">(</span>value val<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>add e1 e2<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>eval-op <span style="color: #4f97d7;">+</span> env e1 e2<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>minus e1 e2<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>eval-op <span style="color: #4f97d7;">-</span> env e1 e2<span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span>
    <span style="color: #4f97d7; font-weight: bold;">...</span>
    <span style="color: #2d9574;">[</span><span style="color: #67b11d;">(</span>var v<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span>lookup-env env <span style="color: #b1951d;">(</span>var-id v<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
<section id="slide-3-10">
<h3 id="3-10"><span class="section-number-3">3.10.</span> Writing the interpreter</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">op-value</span> f env v1 v2<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">cons</span> env <span style="color: #2d9574;">(</span>value <span style="color: #67b11d;">(</span>f <span style="color: #b1951d;">(</span>value-value v1<span style="color: #b1951d;">)</span>
                      <span style="color: #b1951d;">(</span>value-value v2<span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">eval-op</span> f env e1 e2<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">let*</span> <span style="color: #2d9574;">(</span><span style="color: #67b11d;">[</span><span style="color: #7590db;">r1</span> <span style="color: #b1951d;">(</span>eval-expr env e1<span style="color: #b1951d;">)</span><span style="color: #67b11d;">]</span>
         <span style="color: #67b11d;">[</span><span style="color: #7590db;">r2</span> <span style="color: #b1951d;">(</span>eval-expr <span style="color: #4f97d7;">(</span><span style="color: #4f97d7;">car</span> r1<span style="color: #4f97d7;">)</span> e2<span style="color: #b1951d;">)</span><span style="color: #67b11d;">]</span><span style="color: #2d9574;">)</span>
    <span style="color: #2d9574;">(</span>op-value f <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">car</span> r2<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">cdr</span> r1<span style="color: #67b11d;">)</span> <span style="color: #67b11d;">(</span><span style="color: #4f97d7;">cdr</span> r2<span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>
</pre>
</div>

</section>
</section>
<section>
<section id="slide-4">
<h2 id="4"><span class="section-number-2">4.</span> Making IMP language</h2>
<div class="outline-text-2" id="text-4">
</div>
</section>
<section id="slide-4-1">
<h3 id="4-1"><span class="section-number-3">4.1.</span> Creating languages in Racket</h3>
<ul>
<li>To create a new language using a <span class="underline">raco</span> project, you
need to define a reader.</li>
<li>A reader is a module that implements a function named
<span class="underline">read-syntax</span></li>

</ul>

</section>
<section id="slide-4-2">
<h3 id="4-2"><span class="section-number-3">4.2.</span> Creating languages in Racket</h3>
<ul>
<li>The function read-syntax receives two parameters:
<ol>
<li>the path of the input file and 2) the port to read data from the file.</li>

</ol></li>

<li>It should return a <span class="underline">syntax object</span> of the code parsed
from the input file.</li>

</ul>

</section>
<section id="slide-4-3">
<h3 id="4-3"><span class="section-number-3">4.3.</span> The IMP reader</h3>
<div class="org-src-container">

<pre class="src src-racket"><span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">provide</span> <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7; font-weight: bold;">rename-out</span> <span style="color: #2d9574;">[</span>imp-read-syntax <span style="color: #4f97d7;">read-syntax</span><span style="color: #2d9574;">]</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">imp-read-syntax</span> path port<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">datum-&gt;syntax</span>
   <span style="color: #a45bad;">#f</span>
   `<span style="color: #2d9574;">(</span><span style="color: #4f97d7; font-weight: bold;">module</span> <span style="color: #bc6ec5; font-weight: bold;">imp-mod</span> <span style="color: #7590db;">racket</span>
      ,<span style="color: #67b11d;">(</span>finish <span style="color: #b1951d;">(</span>imp-interp <span style="color: #4f97d7;">(</span>parse port<span style="color: #4f97d7;">)</span><span style="color: #b1951d;">)</span><span style="color: #67b11d;">)</span><span style="color: #2d9574;">)</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>

<span style="color: #4f97d7;">(</span><span style="color: #4f97d7; font-weight: bold;">define</span> <span style="color: #bc6ec5;">(</span><span style="color: #bc6ec5; font-weight: bold;">finish</span> env<span style="color: #bc6ec5;">)</span>
  <span style="color: #bc6ec5;">(</span><span style="color: #4f97d7;">displayln</span> <span style="color: #2d9574;">"Finished!"</span><span style="color: #bc6ec5;">)</span><span style="color: #4f97d7;">)</span>  
</pre>
</div>

</section>
